<?php
include_once('bg_ordered_readings.php');

/*======================================================================================================
					ФУНКЦИЯ ДЛЯ РАСЧЕТА ЧТЕНИЙ НА ЗАДАННУЮ ДАТУ
					
	Версия 2.0

		bg_feast_readings ($date)
	Параметры:
		$date - дата по новому стилю в формате Y-m-d
				
=========================================================================================================*/
class FeastReadings extends OrderedReadings {

/*******************************************************************************
	Функция проверяет приходится ли событие на заданную дату
		$event - событие
		$date - дата 
		$shift - смещение (дней) от указанной даты (по умолчанию 0)
				(+) - смещение вперед
				(-) - смещение назад
	Возвращает:
		true - если событие приходится на дату, false - нет
*******************************************************************************/
	private function bg_is_event_date ($event, $the_date, $shift=0) {
		list($year, $m, $d) = explode ('-', $the_date);
		$date = date( 'Y-m-d', mktime ( 0, 0, 0, $m, $d-$shift, $year ) );
		
		list($year, $m, $d) = explode ('-', $date);
		$wd = date( 'N', mktime ( 0, 0, 0, $m, $d, $year ) );
		
	//	echo $the_date.' '.$date.' '.$wd.'<br>';

		$begin = $this->bg_get_new_date ($event['begin'], $year);
		$end = $this->bg_get_new_date ($event['end'], $year);
		
	//	echo $begin.' '.$end.' '.$event['name'].'<br>';
		
		if ($begin > $end) {		// Интервал начинается в одном году, а заканчивается в другом
			if (($begin <= $date && $date <= $year.'-12-31') ||	// проверяем интервал в конце года
				($year.'-01-01' <= $date && $date <= $end))	{	// проверяем интервал в начале года
	//			echo $wd.' '.$date.$event['name'].'<br>';
				return in_array($wd, $event['weekdays']);
			}
		} else {					// Интервал в текущем году	
			 if ($begin <= $date && $date <= $end) {			// проверяем этот интервал
	//			echo $wd.' '.$date.$event['name'].'<br>';
				return in_array($wd, $event['weekdays']);
			 }
		}
		return false;
	}	

/*******************************************************************************
	Функция вычисляет дату по новому стилю в текущем году
		$old  - дата по старому стилю (в формате m-d)
		$year - год (в формате Y)
	Возвращает:
		дата по новому стилю
*******************************************************************************/
	private function bg_get_new_date ($old, $year) {
		list($m, $d) = explode ('-', $old, 2);
		if ($m == 0) {	// Переходящий праздник
			 $date = $this->bg_get_easter($year, $d);
		} else {
			$dd = ($m < 3)?$this->bg_ddif($year-1):$this->bg_ddif($year);
			$date = date( 'Y-m-d', mktime ( 0, 0, 0, $m, $d+$dd, $year ) );
			if ($date > $year.'12-31') {
				$dd = ($m < 3)?$this->bg_ddif($year-2):$this->bg_ddif($year-1);
				$date = date( 'Y-m-d', mktime ( 0, 0, 0, $m, $d+$dd, $year-1 ) );
			}
		}
		return $date;
	}

/*========================================================================================
	Функция объединяет чтения Апостола и Евангелие на Великие, бденные и другие праздники, 
	с рядовыми чтениями по правилам Типикона. А также добавляет в список чтений другие 
	отрывки из Священного Писания в соответствии с Уставом
	Параметры:
		$date - дата в формате Y-m-d
	Возвращает:
		Текст, содержащий список ссылок на Священное Писание
		
	Правила Типикона:
	1.	В великие праздники Господские, Богородичные и святых, которым положено бдение, 
		рядовые Апостол и Евангелие не читаются, а только данному празднику или святому. 
		
		При этом, рядовые чтения переносятся как правило на предшествующий празднику день.
		Однако, если праздник случается в понедельник, то чтения переносятся вперед, 
		на вторник.
		
	2.	Но если великий Богородичен праздник или святого с бдением случится в воскресный день, 
		тогда читается сначала воскресный рядовой Апостол и Евангелие, а потом уже праздника 
		или святого.
		
	3.	Чтения всем остальным полиелейным, малым и вседневным праздникам, иконам Пресвятой 
		Богородице, ангелам, апостолам и святым выводим отдельной строкой после основных чтений 
		с указанием лика святости.
	
	4.	Для полиелейных праздников предусмотрены специальные чтения Евангелие на Утрене, 
		которые отображаются в будние дни. Если полиелейный праздник приходится на воскресенье, 
		то на утрени читается воскресное Евангелие. 
		
 ========================================================================================*/
	public function bg_feast_readings ($date) {

	//	ДАННЫЕ ПРАЗДНИКОВ
	//		begin,end	- период, когда возможно данное событие (по старому стилю)
	//		weekdays	- дни недели, когда возможно данное событие
	//		type		- тип события
	//		refs		- ссылка на отрывок в Библии
	//		name		- название (описание) события

		$events = [
		// Бденные праздники
			['begin'=>'01-17','end'=>'01-17','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Мф.9:27–30','Евр.13:17–21','Лк.6:17–23'],'name'=>' Антония Великого'],
			['begin'=>'01-20','end'=>'01-20','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Мф.9:27–30','Евр.13:17–21','Лк.6:17–23'],'name'=>'Евфимия Великого'],
			['begin'=>'01-30','end'=>'01-30','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Ин.10:9-16','Евр.13:7-16','Мф.5:14-19'],'name'=>'Свв. Василия Великого, Григория Богослова и Иоанна Златоустого'],
			['begin'=>'04-23','end'=>'04-23','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Лк.12:2-12','Деян.12:1-11','Ин.15:17-16:2'],'name'=>'Георгия Победоносца'], 
			['begin'=>'05-08','end'=>'05-08','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Ин.21:15-25','1Ин.1:1-7','Ин.19:25-27,21:24-25'],'name'=>'Иоанна Богослова'],
			['begin'=>'05-11','end'=>'05-11','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Ин.10:9-16','Евр.7:26-8:2','Мф.5:14-19'],'name'=>'Кирилла и Мефодия'],
			['begin'=>'06-24','end'=>'06-24','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Лк.1:24-25,57-68,76,80','Рим.13:12-14:4','Лк.1:5-25,57-68,76,80'],'name'=>'Рожд. Иоанна Предтечи'],
			['begin'=>'06-29','end'=>'06-29','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Ин.21:15-25','2Кор.11:21-12:9','Мф.16:13-19'],'name'=>'Петра и Павла'],
			['begin'=>'07-08','end'=>'07-08','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Лк.1:39-49,56','Флп.2:5-11','Лк.10:38-42,11:27-28'],'name'=>'Казанской иконы Богоматери'],
			['begin'=>'07-15','end'=>'07-15','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Мф.13:44–54','Гал.1:11–19','Ин.10:1–9'],'name'=>'кн. Владимира'],
			['begin'=>'07-19','end'=>'07-19','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Мф.11:27–30','Гал.5:22–6:2','Лк.6:17–23'],'name'=>'Серафима Саровского'],
			['begin'=>'08-29','end'=>'08-29','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Мф.14:1-13','Деян.13:25-32','Мк.6:14-30'],'name'=>'Усекновение главы Иоанна Предтечи'],
			['begin'=>'09-25','end'=>'09-25','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Мф.11:27–30.','Гал.5:22–6:2','Лк.6:17–23'],'name'=>'Прп. Сергия Радонежского'],
			['begin'=>'09-26','end'=>'09-26','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Ин.21:15-25','1Ин.4:12-19','Ин.19:25-27,21:24-25'],'name'=>'Преставление Иоанна Богослова'],
			['begin'=>'10-22','end'=>'10-22','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Лк.1:39-49,56','Флп.2:5-11','Лк.10:38-42,11:27-28'],'name'=>'Казанской иконы Богоматери'], 
			['begin'=>'11-08','end'=>'11-08','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Мф.13:24–30,36–43','Евр.2:2–10','Лк.10:16–21'],'name'=>'Бесплотных'],
			['begin'=>'11-13','end'=>'11-13','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Ин.10:1–9','Евр.7:26–8:2','Ин.10:9–16'],'name'=>'Иоанна Златоустого'],
			['begin'=>'12-05','end'=>'12-05','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Лк.6:17–23','Гал.5:22–6:2','Мф.11:27–30'],'name'=>'Саввы Освященного'],
			['begin'=>'12-06','end'=>'12-06','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Ин.10:9-16','Евр.13:17-21','Лк.6:17-23'],'name'=>'Николая Мирликийского'],
			
		// Богородничные праздники
			['begin'=>'03-25','end'=>'03-25','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Лк.1:39-49,56','Евр.2:11-18','Лк.1:24-38'],'name'=>'Благовещение'],
			['begin'=>'08-15','end'=>'08-15','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Лк.1:39-49,56','Флп.2:5-11','Лк.10:38-42,11:27-28'],'name'=>'Успение Богородицы'],
			['begin'=>'09-08','end'=>'09-08','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Лк.1:39-49,56','Флп.2:5-11','Лк.10:38-42,11:27-28'],'name'=>'Рождество Богородицы'],
			['begin'=>'10-01','end'=>'10-01','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Лк.1:39-49,56','Евр.9:1-7','Лк.10:38-42,11:27-28'],'name'=>'Покров'],
			['begin'=>'11-21','end'=>'11-21','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['Лк.1:39-49,56','Евр.9:1-7','Лк.10:38-42,11:27-28'],'name'=>'Введение'],
			['begin'=>'12-26','end'=>'12-26','weekdays'=>[1,2,3,4,5,6,7],'type'=>2,'refs'=>['','Евр.2:11-18','Мф.2:13-23'],'name'=>'Собор Пресвятой Богородицы'],

		// Господские праздники
			['begin'=>'01-01','end'=>'01-01','weekdays'=>[1,2,3,4,5,6,7],'type'=>1,'refs'=>['Ин.10:1-9','Кол.2:8-12','Лк.2:20-21,40-52'],'name'=>'Обрезание Господне'],
			['begin'=>'02-02','end'=>'02-02','weekdays'=>[1,2,3,4,5,6,7],'type'=>1,'refs'=>['Лк.2:25-32','Евр.7:7-17','Лк.2:22-40'],'name'=>'Сретение'],
			['begin'=>'01-05','end'=>'01-05','weekdays'=>[6,7],'type'=>1,'refs'=>['','1Кор.10:1-4','Лк.3:1-18'],'name'=>'Навечерие Богоявления'],
			['begin'=>'01-05','end'=>'01-05','weekdays'=>[1,2,3,4,5],'type'=>1,'refs'=>['','1Кор.9:19-27','Лк.3:1-18]'],'name'=>'Навечерие Богоявления'],
			['begin'=>'01-06','end'=>'01-06','weekdays'=>[1,2,3,4,5,6,7],'type'=>1,'refs'=>['Мк.1:9-11','Тит.2:11-14,3:4-7','Мф.3:13-17'],'name'=>'Богоявление'],
			['begin'=>'08-01','end'=>'08-01','weekdays'=>[1,2,3,4,5,6,7],'type'=>1,'refs'=>['','1Кор.1:18-24','Ин.19:6-11,13-20,25-28,30-35'],'name'=>'Креста'],
			['begin'=>'08-06','end'=>'08-06','weekdays'=>[1,2,3,4,5,6,7],'type'=>1,'refs'=>['Лк.9:28-36','2Пет.1:10-19','Мф.17:1-9'],'name'=>'Преображение'],
			['begin'=>'09-01','end'=>'09-01','weekdays'=>[1,2,3,4,5,6,7],'type'=>1,'refs'=>['','1Тим.2:1–7','Лк.4:16–22'],'name'=>'Новолетия'],
			['begin'=>'09-13','end'=>'09-13','weekdays'=>[1,2,3,4,5,6,7],'type'=>1,'refs'=>['','Евр.3:1–4','Мф.16:13–18'],'name'=>'Обновления'],
			['begin'=>'09-14','end'=>'09-14','weekdays'=>[1,2,3,4,5,6,7],'type'=>1,'refs'=>['Ин.12:28-36','1Кор.1:18-24','Ин.19:6-11,13-20,25-28,30-35'],'name'=>'Воздвижение'],
			['begin'=>'12-24','end'=>'12-24','weekdays'=>[6,7],'type'=>1,'refs'=>['','Гал.3:15-22','Мф.13:31-36'],'name'=>'Навечерие Рождества Христова'],
			['begin'=>'12-24','end'=>'12-24','weekdays'=>[1,2,3,4,5],'type'=>1,'refs'=>['','Евр.1:1-12','Лк.2:1-20'],'name'=>'Навечерие Рождества Христова'],
			['begin'=>'12-25','end'=>'12-25','weekdays'=>[1,2,3,4,5,6,7],'type'=>1,'refs'=>['Мф.1:18-25','Гал.4:4-7','Мф.2:1-12'],'name'=>'Рождество'],
			['begin'=>'00-39','end'=>'00-39','weekdays'=>[4],'type'=>10,'refs'=>['Мк.16:9-20','Деян.1:1–12','Лк.24:36–53'],'name'=>'Вознесение'],

		// Субботы и Недели
			['begin'=>'09-07','end'=>'09-07','weekdays'=>[6],'type'=>9,'refs'=>['','1Кор.2:6-9','Мф.10:37-11:1'],'name'=>'Суббота пред Воздвижением'],
			['begin'=>'09-09','end'=>'09-13','weekdays'=>[6],'type'=>9,'refs'=>['','1Кор.2:6-9','Мф.10:37-11:1'],'name'=>'Суббота пред Воздвижением'],
			['begin'=>'09-07','end'=>'09-13','weekdays'=>[7],'type'=>9,'refs'=>['','Гал.6:11-18','Ин.3:13-17'],'name'=>'Неделя пред Воздвижением'],
			['begin'=>'09-15','end'=>'09-20','weekdays'=>[6],'type'=>9,'refs'=>['','1Кор.1:26-29','Ин.8:21-30'],'name'=>'Суббота по Воздвижению'],
			['begin'=>'09-15','end'=>'09-21','weekdays'=>[7],'type'=>9,'refs'=>['','Гал.2:16-20','Мк.8:34-9:1'],'name'=>'Неделя по Воздвижению'],
			
			['begin'=>'12-18','end'=>'12-24','weekdays'=>[6],'type'=>9,'refs'=>['','Гал.3:8-12','Лк.13:18-29'],'name'=>'Суббота пред Рождеством'],
			['begin'=>'12-18','end'=>'12-24','weekdays'=>[7],'type'=>8,'refs'=>['','Евр.11:9-10,17-23,32-40','Мф.1:1-25'],'name'=>'Неделя пред Рождеством'],
			['begin'=>'12-26','end'=>'12-31','weekdays'=>[6],'type'=>9,'refs'=>['','1Тим.6:11-16','Мф.12:15-21'],'name'=>'Суббота по Рождестве'],
			['begin'=>'12-31','end'=>'12-31','weekdays'=>[5],'type'=>9,'refs'=>['','1Тим.6:11-16','Мф.12:15-21'],'name'=>'Суббота по Рождестве'],	// Если приходится на 01-01, то переносим на пятницу
			['begin'=>'12-26','end'=>'12-31','weekdays'=>[7],'type'=>8,'refs'=>['','Гал.1:11-19','Мф.2:13-23'],'name'=>'Неделя по Рождестве'],		

			['begin'=>'12-30','end'=>'01-05','weekdays'=>[6],'type'=>9,'refs'=>['','1Тим.3:14-4:5','Мф.3:1-11'],'name'=>'Суббота пред Богоявлением'],
			['begin'=>'01-01','end'=>'01-05','weekdays'=>[7],'type'=>8,'refs'=>['','2Тим.4:5-8','Мк.1:1-8'],'name'=>'Неделя пред Богоявлением'],
			['begin'=>'01-01','end'=>'01-01','weekdays'=>[1,2],'type'=>8,'refs'=>['','2Тим.4:5-8','Мк.1:1-8'],'name'=>'Неделя пред Богоявлением'],	// Если приходится на 12-30 или 12-31, то переносим на понедельник 01-01
			['begin'=>'01-07','end'=>'01-12','weekdays'=>[6],'type'=>9,'refs'=>['','Еф.6:10-17','Мф.4:1-11'],'name'=>'Суббота по Богоявлению'],
			['begin'=>'01-07','end'=>'01-13','weekdays'=>[7],'type'=>9,'refs'=>['','Еф.4:7-13','Мф.4:12-17'],'name'=>'Неделя по Богоявлению'],

		// Полиелейные, малые и вседневные праздники
			['begin'=>'09-01','end'=>'09-01','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Кол.3:12–16','Мф.11:27–30'],'name'=>'Прп.'],
			['begin'=>'09-02','end'=>'09-02','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Рим.8:28–39','Ин.15:1–7'],'name'=>'Мч.'],
			['begin'=>'09-03','end'=>'09-03','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.13:7–16','Ин.10:9–16'],'name'=>'Сщмч.'],
			['begin'=>'09-04','end'=>'09-04','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.11:33–12:2','Лк.12:32–40'],'name'=>'Свв.'],
			['begin'=>'09-05','end'=>'09-05','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.6:13–20','Мф.23:29–39'],'name'=>'Прор.'],
			['begin'=>'09-06','end'=>'09-06','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.2:2–10','Лк.10:16–21'],'name'=>'Архангела'],
			['begin'=>'09-07','end'=>'09-07','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10–17','Ин.15:17–16:2'],'name'=>'Мч.'],
			['begin'=>'09-09','end'=>'09-09','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.4:22–31','Лк.8:16–21'],'name'=>'Богоотцов'],
			['begin'=>'09-09','end'=>'09-09','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22–6:2','Мф.11:27–30'],'name'=>'Прп.'],
			['begin'=>'09-11','end'=>'09-11','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27–30','Гал.5:22–6:2','Лк.6:17–23'],'name'=>'Прп.'],
			['begin'=>'09-12','end'=>'09-12','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Флп.2:5–11','Лк.10:38–42;11:27–28'],'name'=>'Богородицы'],
			['begin'=>'09-15','end'=>'09-15','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Тим.2:1–10','Мф.10:16–22'],'name'=>'Вмч.'],
			['begin'=>'09-16','end'=>'09-16','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Кор.6:1–10','Лк.7:36–50'],'name'=>'Вмч.'],
			['begin'=>'09-20','end'=>'09-20','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10–17','Лк.21:12–19'],'name'=>'Вмч.'],
			['begin'=>'09-21','end'=>'09-21','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.7:26–8:2','Ин.10:9–16'],'name'=>'Свт.'],
			['begin'=>'09-22','end'=>'09-22','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.4:14–5:6','Ин.10:9–16'],'name'=>'Сщмч.'],
			['begin'=>'09-23','end'=>'09-23','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.4:22–31','Лк.1:5–25'],'name'=>'Предтечи'],
			['begin'=>'09-24','end'=>'09-24','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Тим.3:10–15','Мф.25:1–13'],'name'=>'Первомц.'],
			['begin'=>'09-28','end'=>'09-28','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.4:25–5:12','2Кор.4:6–15','Лк.6:17–23'],'name'=>'Прп. Харитона'],
			['begin'=>'09-29','end'=>'09-29','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22–6:2','Лк.6:17–23'],'name'=>'Прп.'],
			['begin'=>'09-30','end'=>'09-30','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1–9','Евр.7:26–8:2','Ин.10:9–16'],'name'=>'Свт.'],
			['begin'=>'10-02','end'=>'10-02','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','1Тим.1:12–17','Ин.10:9–16'],'name'=>'Свв.'],
			['begin'=>'10-03','end'=>'10-03','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Деян.17:16–34','Мф.13:44–54'],'name'=>'Сщмчч.'],
			['begin'=>'10-04','end'=>'10-04','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['','Евр.13:17–21','Мф.5:14–19'],'name'=>'Свтт.'],
			['begin'=>'10-05','end'=>'10-05','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:9–16','Евр.13:17–21','Мф.5:14–19'],'name'=>'Свтт.'],
			['begin'=>'10-06','end'=>'10-06','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.21:15–25','1Кор.4:9–16','Ин.20:19–31'],'name'=>'Ап.'],
			['begin'=>'10-07','end'=>'10-07','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.11:33–12:2','Лк.21:12–19'],'name'=>'Мчч.'],
			['begin'=>'10-09','end'=>'10-09','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.21:15–25','1Кор.4:9–16','Лк.10:16–21'],'name'=>'Ап.'],
			['begin'=>'10-10','end'=>'10-10','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27–30','Гал.5:22–6:2','Лк.6:17–23'],'name'=>'Прп.'],
			['begin'=>'10-11','end'=>'10-11','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Деян.8:26–39','Лк.10:1–21'],'name'=>'Ап.'],
			['begin'=>'10-12','end'=>'10-12','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10–17','Лк.21:12–19'],'name'=>'Мчч.'],
			['begin'=>'10-13','end'=>'10-13','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39–49,56','Флп.2:5–11','Лк.10:38–42;11:27–28'],'name'=>'Богородицы'],
			['begin'=>'10-08','end'=>'10-14','weekdays'=>[7],'type'=>5,'refs'=>['','Евр.13:7–16','Ин.17:1–13'],'name'=>'Свв. отцов'],
			['begin'=>'10-15','end'=>'10-15','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.12:8–12','Еф.6:10–17','Лк.12:8–12'],'name'=>'Свт.'],
			['begin'=>'10-16','end'=>'10-16','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Тим.2:1–10','Мф.27:33–54'],'name'=>'Мч.'],
			['begin'=>'10-18','end'=>'10-18','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.21:15–25','Кол.4:5–9,14,18','Лк.10:16–21'],'name'=>'Ап.'],
			['begin'=>'10-20','end'=>'10-20','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Тим.2:1–10','Ин.15:17–16:2'],'name'=>'Вмч.'],
			['begin'=>'10-21','end'=>'10-21','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Кор.9:6–11','Лк.6:17–23'],'name'=>'Прп.'],
			['begin'=>'10-23','end'=>'10-23','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.1:11–19','Мф.13:54–58'],'name'=>'Ап.'],
			['begin'=>'10-24','end'=>'10-24','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39–49,56','Флп.2:5–11','Лк.10:38–42;11:27–28'],'name'=>'Богородицы'],
			['begin'=>'10-25','end'=>'10-25','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.4:7–13','Мф.10:1–8'],'name'=>'Мчч.'],
			['begin'=>'10-26','end'=>'10-26','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.10:16–22','2Тим.2:1–10','Ин.15:17–16:2'],'name'=>'Вмч.'],
			['begin'=>'10-26','end'=>'10-26','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.12:6–13,25–27','Мф.8:23–27'],'name'=>'Трясения'],
			['begin'=>'10-27','end'=>'10-27','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10–17','Лк.21:12–19'],'name'=>'Мч.'],
			['begin'=>'10-28','end'=>'10-28','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1–9','Евр.7:26–8:2','Ин.10:9–16'],'name'=>'Свт.'],
			['begin'=>'10-29','end'=>'10-29','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22–6:2','Мф.11:27–30'],'name'=>'Прп.'],
			['begin'=>'11-01','end'=>'11-01','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','1Кор.12:27–13:8','Мф.10:1,5–8'],'name'=>'Бессребреников'],
			['begin'=>'11-02','end'=>'11-02','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10–17','Мф.10:16–22'],'name'=>'Мчч.'],
			['begin'=>'11-03','end'=>'11-03','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10–17','Лк.21:12–19'],'name'=>'Свв.'],
			['begin'=>'11-04','end'=>'11-04','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22–6:2','Мф.4:25–5:12'],'name'=>'Прп.'],
			['begin'=>'11-05','end'=>'11-05','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:9–16','Евр.7:26–8:2','Ин.10:9–16'],'name'=>'Свт.'],
			['begin'=>'11-06','end'=>'11-06','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22–6:2','Лк.6:17–23'],'name'=>'Прп.'],
			['begin'=>'11-06','end'=>'11-06','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.7:26–8:2','Лк.12:8–12'],'name'=>'Свт.'],
			['begin'=>'11-07','end'=>'11-07','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22–6:2','Мф.4:25–5:12'],'name'=>'Прп.'],
			['begin'=>'11-09','end'=>'11-09','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Флп.2:5-11','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'11-11','end'=>'11-11','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10-17','Мф.10:32-33,37-38;19:27-30'],'name'=>'Мчч.'],
			['begin'=>'11-11','end'=>'11-11','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.13:17-21','Мф.4:25-5:12'],'name'=>'Прп.'],
			['begin'=>'11-11','end'=>'11-11','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Мф.4:25-5:12'],'name'=>'Блж.'],
			['begin'=>'11-12','end'=>'11-12','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.4:14-5:6','Лк.6:17-23'],'name'=>'Свт.'],
			['begin'=>'11-14','end'=>'11-14','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.21:15–25','1Кор.4:9-16','Ин.1:43-51'],'name'=>'Ап.'],
			['begin'=>'11-15','end'=>'11-15','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10-17','Лк.12:8-12'],'name'=>'Мчч.'],
			['begin'=>'11-16','end'=>'11-16','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.21:15-25.','1Кор.4:9-16','Мф.9:9-13'],'name'=>'Ап.'],
			['begin'=>'11-17','end'=>'11-17','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Мф.4:25-5:12'],'name'=>'Прп.'],
			['begin'=>'11-17','end'=>'11-17','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','1Кор.12:7-11','Мф.10:1,5-8'],'name'=>'Свт.'],
			['begin'=>'11-19','end'=>'11-19','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1–9','Еф.6:10-17','Мф.5:14-19'],'name'=>'Свт.'],
			['begin'=>'11-20','end'=>'11-20','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.7:26-8:2','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'11-22','end'=>'11-22','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Флм.1:1-25','Лк.10:1-15'],'name'=>'Апп.'],
			['begin'=>'11-23','end'=>'11-23','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Мф.11:27-30'],'name'=>'Блгв.кн.'],
			['begin'=>'11-24','end'=>'11-24','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10-17','Лк.21:12-19'],'name'=>'Свв.'],
			['begin'=>'11-25','end'=>'11-25','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.9:1-7','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'11-25','end'=>'11-25','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Флп.3:20-4:3','Мф.5:14-19'],'name'=>'Сщмчч.'],
			['begin'=>'11-27','end'=>'11-27','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39-49,56','Евр.9:1-7','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'11-27','end'=>'11-27','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10-17','Ин.15:1-7'],'name'=>'Вмч.'],
			['begin'=>'11-28','end'=>'11-28','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Тим.1:8-18','Мф.10:23-31'],'name'=>'Прмч.'],
			['begin'=>'11-28','end'=>'11-28','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Рим.8:28-39','Лк.21:12-19'],'name'=>'Сщмч.'],
			['begin'=>'11-30','end'=>'11-30','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.4:18-23','1Кор.4:9-16','Ин.1:35-51'],'name'=>'Ап.'],
			['begin'=>'12-01','end'=>'12-01','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Кол.3:12-16','Лк.6:31-36'],'name'=>'Прав.'],
			['begin'=>'12-03','end'=>'12-03','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Мф.4:25-5:12'],'name'=>'Прп.'],
			['begin'=>'12-04','end'=>'12-04','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.25:1-13','Гал.3:23-29','Мк.5:24-34'],'name'=>'Вмц.'],
			['begin'=>'12-07','end'=>'12-07','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Кор.4:6-15','Лк.6:17-23'],'name'=>'Прп.'],
			['begin'=>'12-09','end'=>'12-09','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.4:22-31','Лк.8:16-21'],'name'=>'Прав. Анны'],
			['begin'=>'12-10','end'=>'12-10','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:9–16','Евр.7:26-8:2','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'12-10','end'=>'12-10','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10-17','Лк.21:12-19'],'name'=>'Мчч.'],
			['begin'=>'12-12','end'=>'12-12','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.13:17–21','Лк.6:17–23'],'name'=>'Свт.'],
			['begin'=>'12-13','end'=>'12-13','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.10:16–22','Еф.6:10-17','Лк.21:12-19'],'name'=>'Мчч.'],
			['begin'=>'12-17','end'=>'12-17','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.11:33-12:2','Лк.11:47-12:1'],'name'=>'Свв.'],
			['begin'=>'12-18','end'=>'12-18','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прав.'],
			['begin'=>'12-20','end'=>'12-20','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.6:1-13','Евр.4:14-5:6','Мф.5:14-19'],'name'=>'Прав.'],
			['begin'=>'12-20','end'=>'12-20','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.4:14-5:7','Мк.9:33-41'],'name'=>'Сщмч.'],
			['begin'=>'12-21','end'=>'12-21','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.7:26-8:2','Лк.6:17-23'],'name'=>'Свт.'],
			['begin'=>'12-22','end'=>'12-22','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.3:23-29','Лк.7:36-50'],'name'=>'Вмц.'],
			['begin'=>'12-23','end'=>'12-23','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10-17','Лк.21:12-19'],'name'=>'Мчч.'],
			['begin'=>'12-26','end'=>'12-26','weekdays'=>[1],'type'=>5,'refs'=>['','Гал.1:11–19','Мф.2:13–23'],'name'=>'Святых Богоотцов'],
			['begin'=>'12-27','end'=>'12-27','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Деян.6:8-15;7:1-5,47-60','Мф.21:33-42'],'name'=>'Первомч.'],
			['begin'=>'12-28','end'=>'12-28','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Рим.8:3-9','Лк.10:19-21'],'name'=>'Мчч.'],
			['begin'=>'12-29','end'=>'12-29','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Кор.5:15-21','Мф.2:13-23'],'name'=>'Мчч.'],
			['begin'=>'12-30','end'=>'12-30','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.7:26-8:2','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'01-01','end'=>'01-01','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.7:26-8:2','Лк.6:17-23'],'name'=>'Свт.'],

			['begin'=>'01-02','end'=>'01-02','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прп.'],
			['begin'=>'01-03','end'=>'01-03','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Тим.2:1-10','Мф.10:16-22'],'name'=>'Мч.'],
			['begin'=>'01-04','end'=>'01-04','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Рим.8:8-14','Лк.10:1-15'],'name'=>'Апп.'],
			['begin'=>'01-07','end'=>'01-07','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Деян.19:1-8','Ин.1:29-34'],'name'=>'Предтечи'],
			['begin'=>'01-09','end'=>'01-09','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.6:17-23','Евр.13:17-21','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'01-10','end'=>'01-10','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.7:26-8:2','Ин.10:9-16'],'name'=>'Свт. Феофана'],
			['begin'=>'01-10','end'=>'01-10','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','1Кор.12:7-11','Мф.10:1-8'],'name'=>'Свт. Григория'],
			['begin'=>'01-11','end'=>'01-11','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.6:17-23','2Кор.4:6-15','Мф.11:27-30'],'name'=>'Прп.'],
			['begin'=>'01-13','end'=>'01-13','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27–30','Гал.5:22-6:2','Лк.6:17–23'],'name'=>'Прп. Иринарха'],
			['begin'=>'01-14','end'=>'01-14','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Рим.8:28-39','Лк.6:17-23'],'name'=>'Прпп.'],
			['begin'=>'01-14','end'=>'01-14','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.10:1-8','1Кор.4:9-16','Мф.25:1-13.'],'name'=>'Равноап.'],
			['begin'=>'01-15','end'=>'01-15','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Мф.11:27-30'],'name'=>'Прпп.'],
			['begin'=>'01-16','end'=>'01-16','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Деян.12:1-11','Ин.21:15-25'],'name'=>'Ап.'],
			['begin'=>'01-17','end'=>'01-17','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Евр.13:17-21','Лк.6:17-23'],'name'=>'Прп.'],
			['begin'=>'01-18','end'=>'01-18','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.13:7-16','Мф.5:14-19'],'name'=>'Свтт.'],
			['begin'=>'01-19','end'=>'01-19','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Мф.11:27-30'],'name'=>'Прп.'],
	//		['begin'=>'01-20','end'=>'01-20','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Евр.13:17-21','Лк.6:17-23'],'name'=>'Прп.'],
			['begin'=>'01-21','end'=>'01-21','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.11:33-12:2','Лк.12:8-12'],'name'=>'Прп. и мч.'],
			['begin'=>'01-21','end'=>'01-21','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'или прп. Максима Грека'],
			['begin'=>'01-22','end'=>'01-22','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Тим.1:3-9','Лк.10:1-15'],'name'=>'Ап.'],
			['begin'=>'01-23','end'=>'01-23','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.13:7-16','Ин.10:9-16'],'name'=>'Сщмч.'],
			['begin'=>'01-24','end'=>'01-24','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Блж.'],
			['begin'=>'01-25','end'=>'01-25','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','1Кор.12:7-11','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'01-25','end'=>'01-25','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.13:7-16','Лк.12:32-40'],'name'=>'Сщмч.'],
			['begin'=>'01-27','end'=>'01-27','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.7:26-8:2','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'01-22','end'=>'01-28','weekdays'=>[7],'type'=>3,'refs'=>['','Рим.8:28-39','Лк.21:8-19'],'name'=>'Мчч.'],
			['begin'=>'01-28','end'=>'01-28','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Мф.11:27-30'],'name'=>'Прп.'],
			['begin'=>'01-29','end'=>'01-29','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.4:14-5:6','Мк.9:33-41'],'name'=>'Сщмч.'],
	//		['begin'=>'01-30','end'=>'01-30','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:9-16','Евр.13:7-16','Мф.5:14-19'],'name'=>'Свтт.'],
			['begin'=>'01-31','end'=>'01-31','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.7:26-8:2','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'01-31','end'=>'01-31','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','1Кор.12:27-13:8','Мф.10:1,5-8'],'name'=>'Бессребреников'],
			['begin'=>'02-01','end'=>'02-01','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Рим.8:28-39','Лк.10:19-21'],'name'=>'Мч.'],
			['begin'=>'02-03','end'=>'02-03','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.9:11-14','Лк.2:25-38'],'name'=>'Прав.'],
			['begin'=>'02-08','end'=>'02-08','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Тим.2:1-10','Мф.10:16-22'],'name'=>'Вмч.'],
			['begin'=>'02-09','end'=>'02-09','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:9-16','Евр.7:26-8:2','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'02-12','end'=>'02-12','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39-49,56','Флп.2:5-11','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'02-12','end'=>'02-12','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:9-16','Евр.13:17-21','Лк.6:17-23'],'name'=>'Свт.'],
			['begin'=>'02-17','end'=>'02-17','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.13:17-21','Ин.10:9-16'],'name'=>'Сщмч.'],
			['begin'=>'02-23','end'=>'02-23','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.25:1-13','Гал.3:23-29','Лк.7:36-50'],'name'=>'Блж.'],
			['begin'=>'02-24','end'=>'02-24','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.7:17-30','2Кор.4:6-15','Мф.11:2-15'],'name'=>'Предтечи'],
			['begin'=>'03-02','end'=>'03-02','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39-49','Флп.2:5-11','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'00--50','end'=>'00--50','weekdays'=>[6],'type'=>4,'refs'=>['','Гал.5:22-6:2','Мф.11:27–30'],'name'=>'Прпп.'],
			['begin'=>'00--43','end'=>'00--43','weekdays'=>[6],'type'=>4,'refs'=>['','2Тим.2:1-10','Ин.15:17-16:2'],'name'=>'Вмч.'],
			['begin'=>'03-09','end'=>'03-09','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.21:12-19','Евр.12:1-10','Мф.20:1-16'],'name'=>'Мчч.'],
			['begin'=>'00--35','end'=>'00--35','weekdays'=>[7],'type'=>4,'refs'=>['','Евр.7:26-8:2','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'00--21','end'=>'00--21','weekdays'=>[7],'type'=>4,'refs'=>['','Еф.5:8–19','Мф.4:25–5:12'],'name'=>'Прп.'],
			['begin'=>'00--15','end'=>'00--15','weekdays'=>[6],'type'=>4,'refs'=>['','Евр.9:1-7','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'00--14','end'=>'00--14','weekdays'=>[7],'type'=>4,'refs'=>['','Гал.3:23-29','Лк.7:36-50'],'name'=>'Прп.'],
			['begin'=>'04-05','end'=>'04-05','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.7:26-8:2','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'04-19','end'=>'04-19','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.25:1-13','Гал.3:23-29','Лк.7:36-50'],'name'=>'Блж.'],
			['begin'=>'00-05','end'=>'00-05','weekdays'=>[5],'type'=>5,'refs'=>['','Флп.2:5-11','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
	//		['begin'=>'04-23','end'=>'04-23','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.12:2-12','Деян.12:1-11','Ин.15:17-16:2'],'name'=>'Вмч.'],
			['begin'=>'04-25','end'=>'04-25','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.10:1-15','1Пет.5:6-14','Мк.6:7-13'],'name'=>'Ап.'],
			['begin'=>'04-27','end'=>'04-27','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','1Кор.4:9-16','Мф.13:54-58'],'name'=>'Ап.'],
			['begin'=>'04-30','end'=>'04-30','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.21:15-25','Деян.12:1-11','Лк.5:1-11'],'name'=>'Ап.'],
			['begin'=>'04-30','end'=>'04-30','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.7:26-8:2','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'05-01','end'=>'05-01','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','1Кор.14:20-25','Лк.4:22-30'],'name'=>'Прор.'],
			['begin'=>'05-02','end'=>'05-02','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.7:26-8:2','Мф.5:14-19'],'name'=>'Свт.'],
			['begin'=>'05-02','end'=>'05-02','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.21:12-19','Рим.8:28-39','Ин.15:17-16:2'],'name'=>'или блгвв. кнн.'],
			['begin'=>'05-03','end'=>'05-03','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.6:17-23','Евр.13:7-16','Мф.11:27-30'],'name'=>'Прп.'],
			['begin'=>'05-06','end'=>'05-06','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Мф.11:27-30'],'name'=>'Прав.'],
			['begin'=>'05-07','end'=>'05-07','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','1Кор.1:18-24','Ин.19:6-11,13-20,25-28,30-35'],'name'=>'Креста'],
			['begin'=>'05-07','end'=>'05-07','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прп.'],
	//		['begin'=>'05-08','end'=>'05-08','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.21:15-25','1Ин.1:1-7','Ин.19:25-27;21:24-25'],'name'=>'Ап.'],
			['begin'=>'05-09','end'=>'05-09','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.13:17-21','Лк.6:17-23'],'name'=>'Свт.'],
			['begin'=>'05-10','end'=>'05-10','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.21:15-25','1Кор.4:9-16','Мф.13:54-58'],'name'=>'Ап.'],
	//		['begin'=>'05-11','end'=>'05-11','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:9-16','Евр.7:26-8:2','Мф.5:14-19'],'name'=>'Равноапп.'],
			['begin'=>'05-12','end'=>'05-12','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.7:26-8:2','Мф.5:14-19'],'name'=>'Свтт.'],
			['begin'=>'05-12','end'=>'05-12','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.13:17-21','Ин.10:9-16'],'name'=>'или сщмч.'],
			['begin'=>'05-15','end'=>'05-15','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Кор.4:6-15','Лк.14:25-35'],'name'=>'Прп.'],
			['begin'=>'05-15','end'=>'05-15','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.21:12-19','2Тим.2:1-10','Ин.15:17-16:2'],'name'=>'Блгв. цар.'],
			['begin'=>'05-17','end'=>'05-17','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.6:1-13','Гал.3:23-29','Мф.25:1-13'],'name'=>'Прп.'],
			['begin'=>'05-19','end'=>'05-19','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Блгв. кн.'],
			['begin'=>'05-20','end'=>'05-20','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.13:17-21','Лк.6:17-23'],'name'=>'Свт.'],
			['begin'=>'05-21','end'=>'05-21','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39-49,56','Деян.26:1-5,12-20','Ин.10:1-9'],'name'=>'Равноапп. (под зачало)'],
			['begin'=>'05-21','end'=>'05-21','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Флп.2:5-11','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'05-22','end'=>'05-22','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.12:2-12','Деян.10:1-16','Ин.15:17-16,2'],'name'=>'Мч.'],
			['begin'=>'05-23','end'=>'05-23','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.8:3-6','Мф.5:14-19'],'name'=>'Свт.'],
			['begin'=>'05-24','end'=>'05-24','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Кол.3:12-16','Мф.11:27-30'],'name'=>'Прп.'],
			['begin'=>'05-24','end'=>'05-24','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Блж.'],
			['begin'=>'05-25','end'=>'05-25','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.7:17-30','2Кор.4:6-15','Мф.11:2-15'],'name'=>'Предтечи'],
			['begin'=>'00-61','end'=>'00-61','weekdays'=>[5],'type'=>5,'refs'=>['','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прп. Варлаама'],
			['begin'=>'05-27','end'=>'05-27','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Еф.6:10-17','Лк.12:8-12'],'name'=>'Прав. Иоанна Русского'],
			['begin'=>'05-29','end'=>'05-29','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.7:26-8:2','Мф.5:14-19'],'name'=>'Свт.'],
			['begin'=>'06-01','end'=>'06-01','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.6:1-13','Евр.4:14-5:6','Мф.5:14-19'],'name'=>'Прав.'],
			['begin'=>'06-03','end'=>'06-03','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Тим.2:1-10','Ин.15:17-16:2'],'name'=>'Блгв. цар.'],
			['begin'=>'06-04','end'=>'06-04','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прп.'],
			['begin'=>'06-08','end'=>'06-08','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Тим.2:1-10','Мф.10:16-22'],'name'=>'Вмч.'],
			['begin'=>'06-08','end'=>'06-09','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22–6:2','Лк.6:17–23'],'name'=>'Прп.'],
			['begin'=>'06-08','end'=>'06-09','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.13:7–16','Мф.5:14–19'],'name'=>'Свт.'],
			['begin'=>'06-10','end'=>'06-10','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.13:17-21','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'06-11','end'=>'06-11','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.21:15-25','Деян.11:19-26','Лк.10:16-21'],'name'=>'Апп.'],
			['begin'=>'06-12','end'=>'06-12','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Мф.11:27-30'],'name'=>'Прпп.'],
			['begin'=>'06-14','end'=>'06-14','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Иак.5:10-20','Лк.4:22-30'],'name'=>'Прор.'],
			['begin'=>'06-14','end'=>'06-14','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прп.'],
			['begin'=>'06-14','end'=>'06-14','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.12:32-40','Евр.13:7-16','Ин.10:9-16'],'name'=>'Сщмч.'],
			['begin'=>'06-15','end'=>'06-15','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.13:17-21','Ин.10:9-16'],'name'=>'Свт. Ионы'],
			['begin'=>'06-16','end'=>'06-16','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.7:26-8:2','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'06-17','end'=>'06-17','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10-17','Лк.21:12-19'],'name'=>'Мчч.'],
			['begin'=>'00-63','end'=>'00-63','weekdays'=>[7],'type'=>5,'refs'=>['','Евр.11:33-12:2','Мф.4:25-5:12'],'name'=>'Свв.'],
			['begin'=>'00-63','end'=>'00-63','weekdays'=>[7],'type'=>3,'refs'=>['Мф.11:27-30','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прпп. отцов'],
			['begin'=>'06-18','end'=>'06-18','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39-49,56','Флп.2:5-11','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'06-18','end'=>'06-18','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Деян.12:1-11','Ин.15:17-16:2'],'name'=>'Мч. Леонтия'],
			['begin'=>'06-19','end'=>'06-19','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.21:15-25','Иуд.1:1-10','Ин.14:21-24'],'name'=>'Ап.'],
			['begin'=>'06-19','end'=>'06-19','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.7:26-8:2','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'06-21','end'=>'06-21','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прп.'],
			['begin'=>'06-21','end'=>'06-21','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10-17','Лк.21:5-7,10-11,20-24'],'name'=>'Мч.'],
			['begin'=>'06-23','end'=>'06-23','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39-49,56','Флп.2:5-11','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
	//		['begin'=>'06-24','end'=>'06-24','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:24-25,57-68,76,80','Рим.13:11-14:4','Лк.1:1-25,57-68,76,80'],'name'=>'Предтечи'],
			['begin'=>'06-25','end'=>'06-25','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Кор.6:1-10','Лк.7:36-50'],'name'=>'Прмц.'],
			['begin'=>'06-25','end'=>'06-25','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Мф.4:25-5:12'],'name'=>'или блгвв. кнн.'],
			['begin'=>'06-26','end'=>'06-26','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39-49,56','Флп.2:5-11','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'06-27','end'=>'06-27','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Лк.12:32-40'],'name'=>'Прп. Сампсона'],
			['begin'=>'06-27','end'=>'06-27','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прп.'],
			['begin'=>'06-28','end'=>'06-28','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39-49,56','Флп.2:5-11','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
	//		['begin'=>'06-29','end'=>'06-29','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.21:15-25','2Кор.11:21-12:9','Мф.16:13-19'],'name'=>'Апп.'],
			['begin'=>'06-30','end'=>'06-30','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','1Кор.4:9-16','Мк.3:13-19'],'name'=>'Апп.'],
			['begin'=>'07-01','end'=>'07-01','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','1Кор.12:27-13:8','Мф.10:1,5-8'],'name'=>'Бессребреников'],
			['begin'=>'07-02','end'=>'07-02','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.9:1-7','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'07-03','end'=>'07-03','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.6:17-23','Евр.13:17-21','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'07-04','end'=>'07-04','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.10:16-22','Рим.8:28-39','Ин.15:17-16:2'],'name'=>'Страстотерпцев'],
			['begin'=>'07-04','end'=>'07-04','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.8:3-6','Мф.7:12-21'],'name'=>'Свт.'],
			['begin'=>'07-04','end'=>'07-04','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Евр.13:7-16','Лк.6:17-23'],'name'=>'Прп.'],
			['begin'=>'07-04','end'=>'07-04','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.10:16-22','Рим.8:28-39','Ин.15:17-16:2'],'name'=>'Блгв. кн.'],
			['begin'=>'07-05','end'=>'07-05','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Кор.6:1-10','Мф.15:21-28'],'name'=>'Прмц.'],
			['begin'=>'07-05','end'=>'07-05','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прп. Афанасия'],
			['begin'=>'07-07','end'=>'07-07','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.3:23-29','Мф.25:1-13'],'name'=>'Прп. Евфросинии'],
	//		['begin'=>'07-08','end'=>'07-08','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39-49,56','Флп.2:5-11','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'07-10','end'=>'07-10','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.27:27-32','1Кор.1:18-24','Мк.15:16-32'],'name'=>'Ризы (под зачало)'],
	//		['begin'=>'07-10','end'=>'07-10','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Мф.4:25-5:12'],'name'=>'Прп.'],
			['begin'=>'07-10','end'=>'07-10','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Гал.5:22-6:2','Мф.4:25-5:12'],'name'=>'Прп. Антония'],
			['begin'=>'07-11','end'=>'07-11','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Кор.6:1-10','Лк.7:36-50'],'name'=>'Свв.'],
			['begin'=>'07-11','end'=>'07-11','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.10:16-22','Евр.7:26-8:2','Ин.10:9-16'],'name'=>'Сщмч.'],
			['begin'=>'07-12','end'=>'07-12','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39-49,56','Флп.2:5-11','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'07-13','end'=>'07-13','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.2:2-10','Лк.10:16-21'],'name'=>'Архангела'],
			['begin'=>'07-14','end'=>'07-14','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Евр.13:17-21','Лк.6:17-23'],'name'=>'Прп.'],
			['begin'=>'07-14','end'=>'07-14','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','1Кор.13:11-14:5','Лк.10:19-21'],'name'=>'Мчч.'],
			['begin'=>'07-15','end'=>'07-15','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:9-16','Гал.1:11-19','Ин.10:1-9'],'name'=>'Равноап.'],
			['begin'=>'07-13','end'=>'07-19','weekdays'=>[7],'type'=>5,'refs'=>['','Евр.13:7-16','Ин.17:1-13'],'name'=>'Свв. отцов '],
			['begin'=>'07-17','end'=>'07-17','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Кор.6:1-10','Лк.7:36-50'],'name'=>'Вмц.'],
	//		['begin'=>'07-19','end'=>'07-19','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прп.'],
			['begin'=>'07-20','end'=>'07-20','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.4:22-30','Иак.5:10-20','Лк.4:22-30'],'name'=>'Прор.'],
			['begin'=>'07-22','end'=>'07-22','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','1Кор.9:2-12','Лк.8:1-3'],'name'=>'Равноап.'],
			['begin'=>'07-23','end'=>'07-23','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39-49','Евр.9:1-7','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'07-24','end'=>'07-24','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.21:12-19','Рим.8:28-39','Ин.15:17-16:2'],'name'=>'Блгвв. кнн.'],
			['begin'=>'07-24','end'=>'07-24','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','2Кор.6:1-10','Лк.7:36-50'],'name'=>'Мц.'],
			['begin'=>'07-25','end'=>'07-25','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.4:22-31','Лк.8:16-21'],'name'=>'Прав. Анны'],
			['begin'=>'07-26','end'=>'07-26','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прп.'],
			['begin'=>'07-27','end'=>'07-27','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.21:12-19','2Тим.2:1-10','Ин.15:17-16:2'],'name'=>'Вмч.'],
			['begin'=>'07-28','end'=>'07-28','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39-49,56','Флп.2:5-11','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'07-28','end'=>'07-28','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.13:17-21','Лк.6:17-23'],'name'=>'Свт.'],
			['begin'=>'07-30','end'=>'07-30','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Рим.15:1-7','Мф.16:24-28'],'name'=>'Мч.'],
			['begin'=>'07-31','end'=>'07-31','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Мф.11:27-30'],'name'=>'Прав.'],
			['begin'=>'08-01','end'=>'08-01','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.11:33-12:2','Мф.10:32-36;11:1'],'name'=>'Мчч.'],
			['begin'=>'08-02','end'=>'08-02','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Мф.11:27-30'],'name'=>'Блж.'],
			['begin'=>'08-02','end'=>'08-02','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Деян.6:8-7:5,47-60','Мф.21:33-42'],'name'=>'Первомч.'],
			['begin'=>'08-03','end'=>'08-03','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прп.'],
			['begin'=>'08-07','end'=>'08-07','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:1-9','Евр.7:26-8:2','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'08-07','end'=>'08-07','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10-17','Ин.15:17-16:2'],'name'=>'или прмч.'],
			['begin'=>'08-08','end'=>'08-08','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прпп.'],
			['begin'=>'08-09','end'=>'08-09','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.21:15-25','Деян.1:12-17,21-26','Лк.9:1-6'],'name'=>'Ап.'],
			['begin'=>'08-10','end'=>'08-10','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.10:16-22','Рим.8:28-39','Лк.21:8-19'],'name'=>'Новомч.'],
			['begin'=>'08-13','end'=>'08-13','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Ин.10:9-16','Евр.7:26-8:2','Мф.5:14-19'],'name'=>'Свт.'],
			['begin'=>'08-14','end'=>'08-14','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прп.'],
			['begin'=>'08-16','end'=>'08-16','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Кол.1:12-18','Лк.9:51-56;10:22-24'],'name'=>'Образа'],
			['begin'=>'08-18','end'=>'08-18','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10-17','Лк.12:2-12'],'name'=>'Мчч.'],
			['begin'=>'08-19','end'=>'08-19','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Еф.6:10-17','Лк.21:12-19'],'name'=>'Мч.'],
			['begin'=>'08-19','end'=>'08-19','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39-49,56','Флп.2:5-11','Лк.10:38-42,11,27-28'],'name'=>'Богородицы'],
			['begin'=>'08-23','end'=>'08-23','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Флп.2:5-11','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'08-24','end'=>'08-24','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.7:26-8:2','Ин.10:9-16'],'name'=>'Свт.'],
			['begin'=>'08-25','end'=>'08-25','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Тит.1:1-4;2:15-3:3,12-13,15','Мф.5:14-19'],'name'=>'Апп.'],
			['begin'=>'08-26','end'=>'08-26','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Лк.1:39-49,56','Флп.2:5-11','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],
			['begin'=>'08-27','end'=>'08-27','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Мф.4:25-5:12'],'name'=>'Прп.'],
			['begin'=>'08-28','end'=>'08-28','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Гал.5:22-6:2','Лк.6:17-23'],'name'=>'Прпп.'],
			['begin'=>'08-30','end'=>'08-30','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.11:27-30','Гал.5:22-6:2','Мф.11:27-30'],'name'=>'Блгв. кн. Александра'],
			['begin'=>'08-30','end'=>'08-30','weekdays'=>[1,2,3,4,5,6,7],'type'=>3,'refs'=>['Мф.5:14-19','2Кор.6:1-10','Лк.6:17-23'],'name'=>'Блгв. кн. Даниила'],
			['begin'=>'08-31','end'=>'08-31','weekdays'=>[1,2,3,4,5,6,7],'type'=>5,'refs'=>['','Евр.9:1-7','Лк.10:38-42;11:27-28'],'name'=>'Богородицы'],

		];
		
		$additional = [
			// Дополнительные чтения (Часы, Вечерня, особые случаи)
			['begin'=>'12-22','end'=>'12-22','weekdays'=>[5],'type'=>99,'refs'=>['','Евр.1:1–12','Мф.1:18–25'],'name'=>'На 1-м часе'],
			['begin'=>'12-22','end'=>'12-22','weekdays'=>[5],'type'=>99,'refs'=>['','Гал.3:23–29','Лк.2:1–20'],'name'=>'На 3-м часе'],
			['begin'=>'12-22','end'=>'12-22','weekdays'=>[5],'type'=>99,'refs'=>['','Евр.1:10–2:3','Мф.2:1–12'],'name'=>'На 6-м часе'],
			['begin'=>'12-22','end'=>'12-22','weekdays'=>[5],'type'=>99,'refs'=>['','Евр.2:11–18','Мф.2:13–23'],'name'=>'На 9-м часе'],
			['begin'=>'12-23','end'=>'12-23','weekdays'=>[5],'type'=>99,'refs'=>['','Евр.1:1–12','Мф.1:18–25'],'name'=>'На 1-м часе'],
			['begin'=>'12-23','end'=>'12-23','weekdays'=>[5],'type'=>99,'refs'=>['','Гал.3:23–29','Лк.2:1–20'],'name'=>'На 3-м часе'],
			['begin'=>'12-23','end'=>'12-23','weekdays'=>[5],'type'=>99,'refs'=>['','Евр.1:10–2:3','Мф.2:1–12'],'name'=>'На 6-м часе'],
			['begin'=>'12-23','end'=>'12-23','weekdays'=>[5],'type'=>99,'refs'=>['','Евр.2:11–18','Мф.2:13–23'],'name'=>'На 9-м часе'],
			['begin'=>'12-24','end'=>'12-24','weekdays'=>[1,2,3,4,5],'type'=>99,'refs'=>['','Евр.1:1–12','Мф.1:18–25'],'name'=>'На 1-м часе'],
			['begin'=>'12-24','end'=>'12-24','weekdays'=>[1,2,3,4,5],'type'=>99,'refs'=>['','Гал.3:23–29','Лк.2:1–20'],'name'=>'На 3-м часе'],
			['begin'=>'12-24','end'=>'12-24','weekdays'=>[1,2,3,4,5],'type'=>99,'refs'=>['','Евр.1:10–2:3','Мф.2:1–12'],'name'=>'На 6-м часе'],
			['begin'=>'12-24','end'=>'12-24','weekdays'=>[1,2,3,4,5],'type'=>99,'refs'=>['','Евр.2:11–18','Мф.2:13–23'],'name'=>'На 9-м часе'],

			['begin'=>'01-03','end'=>'01-03','weekdays'=>[5],'type'=>99,'refs'=>['','Деян.13:25–32','Мф.3:1–11'],'name'=>'На 1-м часе'],
			['begin'=>'01-03','end'=>'01-03','weekdays'=>[5],'type'=>99,'refs'=>['','Деян.19:1–8','Мк.1:1–8'],'name'=>'На 3-м часе'],
			['begin'=>'01-03','end'=>'01-03','weekdays'=>[5],'type'=>99,'refs'=>['','Рим.6:3–11',' Мк.1:9–15'],'name'=>'На 6-м часе'],
			['begin'=>'01-03','end'=>'01-03','weekdays'=>[5],'type'=>99,'refs'=>['','Тит.2:11–14;3:4–7','Мф.3:13–17'],'name'=>'На 9-м часе'],
			['begin'=>'01-04','end'=>'01-04','weekdays'=>[5],'type'=>99,'refs'=>['','Деян.13:25–32','Мф.3:1–11'],'name'=>'На 1-м часе'],
			['begin'=>'01-04','end'=>'01-04','weekdays'=>[5],'type'=>99,'refs'=>['','Деян.19:1–8','Мк.1:1–8'],'name'=>'На 3-м часе'],
			['begin'=>'01-04','end'=>'01-04','weekdays'=>[5],'type'=>99,'refs'=>['','Рим.6:3–11',' Мк.1:9–15'],'name'=>'На 6-м часе'],
			['begin'=>'01-04','end'=>'01-04','weekdays'=>[5],'type'=>99,'refs'=>['','Тит.2:11–14;3:4–7','Мф.3:13–17'],'name'=>'На 9-м часе'],
			['begin'=>'01-05','end'=>'01-05','weekdays'=>[1,2,3,4,5],'type'=>99,'refs'=>['','Деян.13:25–32','Мф.3:1–11'],'name'=>'На 1-м часе'],
			['begin'=>'01-05','end'=>'01-05','weekdays'=>[1,2,3,4,5],'type'=>99,'refs'=>['','Деян.19:1–8','Мк.1:1–8'],'name'=>'На 3-м часе'],
			['begin'=>'01-05','end'=>'01-05','weekdays'=>[1,2,3,4,5],'type'=>99,'refs'=>['','Рим.6:3–11',' Мк.1:9–15'],'name'=>'На 6-м часе'],
			['begin'=>'01-05','end'=>'01-05','weekdays'=>[1,2,3,4,5],'type'=>99,'refs'=>['','Тит.2:11–14;3:4–7','Мф.3:13–17'],'name'=>'На 9-м часе'],
			['begin'=>'01-05','end'=>'01-06','weekdays'=>[1,2,3,4,5,6,7],'type'=>99,'refs'=>['','1Кор.10:1–4','Мк.1:9–11'],'name'=>'На освящении воды'],

			['begin'=>'00--57','end'=>'00--57','weekdays'=>[6],'type'=>99,'refs'=>['','1Сол.4:13–17','Ин.5:24–30'],'name'=>'За упокой'],
			['begin'=>'00--36','end'=>'00--22','weekdays'=>[6],'type'=>99,'refs'=>['','1Сол.4:13–17','Ин.5:24–30'],'name'=>'За упокой'],
			
			['begin'=>'00--48','end'=>'00--48','weekdays'=>[1],'type'=>99,'refs'=>['','Ис.1:1–20',''],'name'=>'На 6-м часе'],
			['begin'=>'00--47','end'=>'00--47','weekdays'=>[2],'type'=>99,'refs'=>['','Ис.1:19–2:3',''],'name'=>'На 6-м часе'],
			['begin'=>'00--46','end'=>'00--46','weekdays'=>[3],'type'=>99,'refs'=>['','Ис.2:3–11',''],'name'=>'На 6-м часе'],
			['begin'=>'00--45','end'=>'00--45','weekdays'=>[4],'type'=>99,'refs'=>['','Ис.2:11–21',''],'name'=>'На 6-м часе'],
			['begin'=>'00--44','end'=>'00--44','weekdays'=>[5],'type'=>99,'refs'=>['','Ис.3:1–14',''],'name'=>'На 6-м часе'],
			['begin'=>'00--48','end'=>'00--48','weekdays'=>[1],'type'=>99,'refs'=>['','Быт.1:1-20','Притч.1:1-20'],'name'=>'На веч.'],
			['begin'=>'00--47','end'=>'00--47','weekdays'=>[2],'type'=>99,'refs'=>['','Быт.1:14-23','Притч.1:20-33'],'name'=>'На веч.'],
			['begin'=>'00--46','end'=>'00--46','weekdays'=>[3],'type'=>99,'refs'=>['','Быт.1:24-2:3','Притч.2:1-22'],'name'=>'На веч.'],
			['begin'=>'00--45','end'=>'00--45','weekdays'=>[4],'type'=>99,'refs'=>['','Быт.2:4-19','Притч.3:1-18'],'name'=>'На веч.'],
			['begin'=>'00--44','end'=>'00--44','weekdays'=>[5],'type'=>99,'refs'=>['','Быт.2:20-3:20','Притч.3:19-34'],'name'=>'На веч.'],
		
			['begin'=>'00--41','end'=>'00--41','weekdays'=>[1],'type'=>99,'refs'=>['','Ис.4:2-5:7',''],'name'=>'На 6-м часе'],
			['begin'=>'00--40','end'=>'00--40','weekdays'=>[2],'type'=>99,'refs'=>['','Ис.5:7-1',''],'name'=>'На 6-м часе'],
			['begin'=>'00--39','end'=>'00--39','weekdays'=>[3],'type'=>99,'refs'=>['','Ис.5:16-25',''],'name'=>'На 6-м часе'],
			['begin'=>'00--38','end'=>'00--38','weekdays'=>[4],'type'=>99,'refs'=>['','Ис.6:1-12',''],'name'=>'На 6-м часе'],
			['begin'=>'00--37','end'=>'00--37','weekdays'=>[5],'type'=>99,'refs'=>['','Ис.8:1-14',''],'name'=>'На 6-м часе'],
			['begin'=>'00--41','end'=>'00--41','weekdays'=>[1],'type'=>99,'refs'=>['','Быт.3:21-4:7','Притч.3:34-4:22'],'name'=>'На веч.'],
			['begin'=>'00--40','end'=>'00--40','weekdays'=>[2],'type'=>99,'refs'=>['','Быт.4:8-15','Притч.5:1-15'],'name'=>'На веч.'],
			['begin'=>'00--39','end'=>'00--39','weekdays'=>[3],'type'=>99,'refs'=>['','Быт.4:16-26','Притч.5:15-6:3'],'name'=>'На веч.'],
			['begin'=>'00--38','end'=>'00--38','weekdays'=>[4],'type'=>99,'refs'=>['','Быт.5:1-24','Притч.6:3-20'],'name'=>'На веч.'],
			['begin'=>'00--37','end'=>'00--37','weekdays'=>[5],'type'=>99,'refs'=>['','Быт.5:30-6:8','Притч.5:20-7:1'],'name'=>'На веч.'],
		
			['begin'=>'00--34','end'=>'00--34','weekdays'=>[1],'type'=>99,'refs'=>['','Ис.8:13-9:7',''],'name'=>'На 6-м часе'],
			['begin'=>'00--33','end'=>'00--33','weekdays'=>[2],'type'=>99,'refs'=>['','Ис.9:9-10:4',''],'name'=>'На 6-м часе'],
			['begin'=>'00--32','end'=>'00--32','weekdays'=>[3],'type'=>99,'refs'=>['','Ис.10:12-20',''],'name'=>'На 6-м часе'],
			['begin'=>'00--31','end'=>'00--31','weekdays'=>[4],'type'=>99,'refs'=>['','Ис.11:10-12:2',''],'name'=>'На 6-м часе'],
			['begin'=>'00--30','end'=>'00--30','weekdays'=>[5],'type'=>99,'refs'=>['','Ис.13:2-13',''],'name'=>'На 6-м часе'],
			['begin'=>'00--34','end'=>'00--34','weekdays'=>[1],'type'=>99,'refs'=>['','Быт.6:9-22','Притч.8:1-21'],'name'=>'На веч.'],
			['begin'=>'00--33','end'=>'00--33','weekdays'=>[2],'type'=>99,'refs'=>['','Быт.7:1-5','Притч.8:32-9:11'],'name'=>'На веч.'],
			['begin'=>'00--32','end'=>'00--32','weekdays'=>[3],'type'=>99,'refs'=>['','Быт.7:6-9','Притч.9:12-18'],'name'=>'На веч.'],
			['begin'=>'00--31','end'=>'00--31','weekdays'=>[4],'type'=>99,'refs'=>['','Быт.7:11-8:3','Притч.10:1-22'],'name'=>'На веч.'],
			['begin'=>'00--30','end'=>'00--30','weekdays'=>[5],'type'=>99,'refs'=>['','Быт.8:4-21','Притч.10:31-11:12'],'name'=>'На веч.'],
		
			['begin'=>'00--27','end'=>'00--27','weekdays'=>[1],'type'=>99,'refs'=>['','Ис.14:24-32',''],'name'=>'На 6-м часе'],
			['begin'=>'00--26','end'=>'00--26','weekdays'=>[2],'type'=>99,'refs'=>['','Ис.25:1-9',''],'name'=>'На 6-м часе'],
			['begin'=>'00--25','end'=>'00--25','weekdays'=>[3],'type'=>99,'refs'=>['','Ис.26:21-27:9',''],'name'=>'На 6-м часе'],
			['begin'=>'00--24','end'=>'00--24','weekdays'=>[4],'type'=>99,'refs'=>['','Ис.28:14-22',''],'name'=>'На 6-м часе'],
			['begin'=>'00--23','end'=>'00--23','weekdays'=>[5],'type'=>99,'refs'=>['','Ис.29:13-23',''],'name'=>'На 6-м часе'],
			['begin'=>'00--27','end'=>'00--27','weekdays'=>[1],'type'=>99,'refs'=>['','Быт.8:21-9:7','Притч.11:19-12:6'],'name'=>'На веч.'],
			['begin'=>'00--26','end'=>'00--26','weekdays'=>[2],'type'=>99,'refs'=>['','Быт.9:8-17','Притч.12:8-22'],'name'=>'На веч.'],
			['begin'=>'00--25','end'=>'00--25','weekdays'=>[3],'type'=>99,'refs'=>['','Быт.9:19-10:1','Притч.12:23-13:9'],'name'=>'На веч.'],
			['begin'=>'00--24','end'=>'00--24','weekdays'=>[4],'type'=>99,'refs'=>['','Быт.10:32-11:9','Притч.13:20-14:6'],'name'=>'На веч.'],
			['begin'=>'00--23','end'=>'00--23','weekdays'=>[5],'type'=>99,'refs'=>['','Быт.12:1-7','Притч.14:15-26'],'name'=>'На веч.'],
		
			['begin'=>'00--20','end'=>'00--20','weekdays'=>[1],'type'=>99,'refs'=>['','Ис.37:33-38:6',''],'name'=>'На 6-м часе'],
			['begin'=>'00--19','end'=>'00--19','weekdays'=>[2],'type'=>99,'refs'=>['','Ис.40:18-31',''],'name'=>'На 6-м часе'],
			['begin'=>'00--18','end'=>'00--18','weekdays'=>[3],'type'=>99,'refs'=>['','Ис.41:4-14',''],'name'=>'На 6-м часе'],
			['begin'=>'00--17','end'=>'00--17','weekdays'=>[4],'type'=>99,'refs'=>['','Ис.42:5-16',''],'name'=>'На 6-м часе'],
			['begin'=>'00--16','end'=>'00--16','weekdays'=>[5],'type'=>99,'refs'=>['','Ис.45:11-17',''],'name'=>'На 6-м часе'],
			['begin'=>'00--20','end'=>'00--20','weekdays'=>[1],'type'=>99,'refs'=>['','Быт.13:13-18','Притч.14:27-15:4'],'name'=>'На веч.'],
			['begin'=>'00--19','end'=>'00--19','weekdays'=>[2],'type'=>99,'refs'=>['','Быт.15:1-15','Притч.15:7-19'],'name'=>'На веч.'],
			['begin'=>'00--18','end'=>'00--18','weekdays'=>[3],'type'=>99,'refs'=>['','Быт.17:1-9','Притч.15:20-16:9'],'name'=>'На веч.'],
			['begin'=>'00--17','end'=>'00--17','weekdays'=>[4],'type'=>99,'refs'=>['','Быт.18:20-33','Притч.16:17-17:17'],'name'=>'На веч.'],
			['begin'=>'00--16','end'=>'00--16','weekdays'=>[5],'type'=>99,'refs'=>['','Быт.22:1-18','Притч.17:17-18:5'],'name'=>'На веч.'],
		
			['begin'=>'00--13','end'=>'00--13','weekdays'=>[1],'type'=>99,'refs'=>['','Ис.48:17-49:4',''],'name'=>'На 6-м часе'],
			['begin'=>'00--12','end'=>'00--12','weekdays'=>[2],'type'=>99,'refs'=>['','Ис.49:6-10',''],'name'=>'На 6-м часе'],
			['begin'=>'00--11','end'=>'00--11','weekdays'=>[3],'type'=>99,'refs'=>['','Ис.58:1-11',''],'name'=>'На 6-м часе'],
			['begin'=>'00--10','end'=>'00--10','weekdays'=>[4],'type'=>99,'refs'=>['','Ис.65:8-16',''],'name'=>'На 6-м часе'],
			['begin'=>'00--09','end'=>'00--09','weekdays'=>[5],'type'=>99,'refs'=>['','Ис.66:10-24',''],'name'=>'На 6-м часе'],
			['begin'=>'00--13','end'=>'00--13','weekdays'=>[1],'type'=>99,'refs'=>['','Быт.27:1-41','Притч.19:19-25'],'name'=>'На веч.'],
			['begin'=>'00--12','end'=>'00--12','weekdays'=>[2],'type'=>99,'refs'=>['','Быт.31:3-16','Притч.21:3-21'],'name'=>'На веч.'],
			['begin'=>'00--11','end'=>'00--11','weekdays'=>[3],'type'=>99,'refs'=>['','Быт.43:26-31, 45:1-16','Притч.21:23-22:4'],'name'=>'На веч.'],
			['begin'=>'00--10','end'=>'00--10','weekdays'=>[4],'type'=>99,'refs'=>['','Быт.46:1-7','Притч.23:23-24:5'],'name'=>'На веч.'],
			['begin'=>'00--09','end'=>'00--09','weekdays'=>[5],'type'=>99,'refs'=>['','Быт.49:33-50:26','Притч.31:8-31'],'name'=>'На веч.'],
		
			['begin'=>'00--03','end'=>'00--03','weekdays'=>[4],'type'=>99,'refs'=>['','','Ин.13:1–11'],'name'=>'На умовении ног'],
			['begin'=>'00--03','end'=>'00--03','weekdays'=>[4],'type'=>99,'refs'=>['','','Ин.13:12–17'],'name'=>'По умовении ног'],
			['begin'=>'00--02','end'=>'00--02','weekdays'=>[5],'type'=>99,'refs'=>['Ин.13:31 –18:1; Ин.18:1–28; Мф.26:57–75; Ин.18:28 –19:16; Мф.27:3–32; Мк.15:16–32; Мф.27:33–54; Лк.23:32–49; Ин.19:25–37; Мк.15:43–47; Ин.19:38–42; Мф.27:62–66.','',''],'name'=>'Евангелия Последования Святых Страстей Господа нашего Иисуса Христа'],
			['begin'=>'00--02','end'=>'00--02','weekdays'=>[5],'type'=>99,'refs'=>['','Гал.6:14–18','Мф.27:1–56'],'name'=>'На 1-м часе'],
			['begin'=>'00--02','end'=>'00--02','weekdays'=>[5],'type'=>99,'refs'=>['','Рим.5:6–11','Мк.15:16–41'],'name'=>'На 3-м часе'],
			['begin'=>'00--02','end'=>'00--02','weekdays'=>[5],'type'=>99,'refs'=>['','Евр.2:11–18','Лк.23:32–49'],'name'=>'На 6-м часе'],
			['begin'=>'00--02','end'=>'00--02','weekdays'=>[5],'type'=>99,'refs'=>['','Евр.10:19–31','Ин.18:28–19:37'],'name'=>'На 9-м часе'],
			['begin'=>'00--02','end'=>'00--02','weekdays'=>[5],'type'=>99,'refs'=>['','1Кор.1:18–2:2','Мф.27:1–44; Лк.,23:39–43; Мф.,27:45–54; Ин.,19:31–37; Мф.,27:55–61'],'name'=>'На веч.'],
			['begin'=>'00-00','end'=>'00-00','weekdays'=>[7],'type'=>99,'refs'=>['','','Ин.20:19–25'],'name'=>'На веч.'],

			['begin'=>'00-48','end'=>'00-48','weekdays'=>[6],'type'=>99,'refs'=>['','1Кор.15:47–57','Ин.6:35–39'],'name'=>'За упокой'],

			['begin'=>'08-01','end'=>'08-01','weekdays'=>[1,2,3,4,5,6,7],'type'=>99,'refs'=>['','Евр.2:11–18','Ин.5:1–4'],'name'=>'На освящении воды'],

			['begin'=>'10-15','end'=>'10-15','weekdays'=>[6],'type'=>5,'refs'=>['','1Сол.4:13–17','Ин.5:24–30'],'name'=>'Заупокой'],
			['begin'=>'10-19','end'=>'10-21','weekdays'=>[6],'type'=>5,'refs'=>['','1Сол.4:13–17','Ин.5:24–30'],'name'=>'Заупокой'],
			['begin'=>'10-23','end'=>'10-25','weekdays'=>[6],'type'=>5,'refs'=>['','1Сол.4:13–17','Ин.5:24–30'],'name'=>'Заупокой'],
		];
		
		list($year, $m, $d) = explode ('-', $date);
		$wd = date( 'N', mktime ( 0, 0, 0, $m, $d, $year ) );
		$easter = $this->bg_get_easter($year);
		
		// Получим рядовые чтения для текущего дня
		$ordinary_refs = array();
		$ordinary_refs[0] = $this->bg_Gospel_at_Matins ($date);
		$ordinary_refs[1] = $this->bg_Apostol_at_Liturgy ($date);
		$ordinary_refs[2] = $this->bg_Gospel_at_Liturgy ($date);
		
		// Рядовые чтения
		$gm = false;
		$text = (!empty($ordinary_refs[2]))?('Ряд: '.($ordinary_refs[0]?(' Утр. - '.$ordinary_refs[0]):'').
				' Лит. - '.$ordinary_refs[1].' '.$ordinary_refs[2].'<br>'):'';

		// На Пасху ни какие другие праздники не служат
		if ($easter != $date ) :

		$before_yesterday = false;
		foreach ($events as $event) {

		// Перенос рядовых чтений из-за праздников
			if ($event["type"] > 2) continue; 		// Только Господские, Богородничные и бденные праздники
			$daysName = ["понедельник", "вторник", "среду", "четверг", "пятницу", "субботу", "воскресенье"];
			if (!$before_yesterday) $before_yesterday = $this->bg_is_event_date ($event, $date, 2);
			$yesterday = $this->bg_is_event_date ($event, $date, 1);
			$tomorow = $this->bg_is_event_date ($event, $date, -1);

			// Обычно рядовые чтения переносим на день перед праздником, при этом воскресные чтения не переносятся ???
			if ($wd < 6 && $tomorow) {	
				$feast = date( 'Y-m-d', mktime ( 0, 0, 0, $m, $d+1, $year ) );
				$feast_wd = date( 'N', mktime ( 0, 0, 0, $m, $d+1, $year ) );
				$text .= 'и за '.$daysName[$feast_wd-1].' (под зачало): '.$this->bg_Apostol_at_Liturgy ($feast).' '.$this->bg_Gospel_at_Liturgy ($feast).'<br>';
			// Eсли случится 2 праздника вподряд, то чтения второго переносим вперед
			} elseif ($wd < 7 && $before_yesterday && $yesterday) {
				$feast = date( 'Y-m-d', mktime ( 0, 0, 0, $m, $d-1, $year ) );
				$feast_wd = date( 'N', mktime ( 0, 0, 0, $m, $d-1, $year ) );
				$text = 'За '.$daysName[$feast_wd-1].': '.$this->bg_Apostol_at_Liturgy ($feast).' '.$this->bg_Gospel_at_Liturgy ($feast).'<br>и за '.$daysName[$feast_wd].' (под зачало) '.$text;
			// А также если праздник случится в понедельник, то чтения переносим вперед, на вторник
			} elseif ($wd == 2 && $yesterday) {
				$feast = date( 'Y-m-d', mktime ( 0, 0, 0, $m, $d-1, $year ) );
				$feast_wd = date( 'N', mktime ( 0, 0, 0, $m, $d-1, $year ) );
				$text = 'За '.$daysName[$feast_wd-1].': '.$this->bg_Apostol_at_Liturgy ($feast).' '.$this->bg_Gospel_at_Liturgy ($feast).'<br>и за '.$daysName[$feast_wd].' (под зачало) '.$text;
			}
		}
		
		// Проверим, есть ли чтения на праздники?
		foreach ($events as $event) {

			if ($this->bg_is_event_date ($event, $date) ) {
				$refs = $event['refs'];
				switch ($event['type']) {
				case 8:		// Субботы и Недели
				case 9:
					if ($gm === false) {	// Нет других событий
						$gm = $refs[0]?$refs[0]:$ordinary_refs[0];
						$text = $event['name'].': '.($gm?(' Утр. - '.$gm):'').' Лит. - '.$refs[1].' '.$refs[2].'<br>';
					} else {
						$text .= $event['name'].':'.' '.$refs[1].' '.$refs[2].'<br>';
					}
					if ($event['type'] == 9) {
						$text .= ' Ряд.(под зачало): '.' '.$ordinary_refs[1].'; '.$ordinary_refs[2].'<br>';
					}
					break;
				case 5:	// Малые и вседневные Минеи
					// В воскресные дни Постной триоди малые и вседневные праздники опускаются
					if ($wd == 7 && $date >= $this->bg_get_easter($year, -70) && $date <= $this->bg_get_easter($year, -7)) break;
				case 4:	// Малые и вседневные Октоиха 	
				case 3:	// Полиелейные
					$text .= $event['name'].':';
					if ($wd < 7 && $event['type'] == 3 && !$gm) {	// Нет других событий
						$gm = $refs[0]?$refs[0]:$ordinary_refs[0];
						$text .= $gm?(' Утр. - '.$gm.' Лит. - '):'';
						$gm = '';
					}
					$text .= ' '.$refs[1].'; '.$refs[2].'<br>';
					break;
				case 2:		// Богородничные и бденные
					$gm = $ordinary_refs[0]?$ordinary_refs[0]:$refs[0];
					$text = '';
					if ($wd == 7 || $wd == 1 || ($date > $this->bg_get_easter($year) && $date < $this->bg_get_easter($year, 50))){
						$text .= ' Ряд.: '.$gm.' Лит. -'.' '.$ordinary_refs[1].' '.$ordinary_refs[2].'<br>';
					}
					$text .= ' '.$event['name'].(($wd==7)?' (под зачало):':($gm?(' Утр. - '.$gm):'')).' Лит. -'.' '.$refs[1].' '.$refs[2].'<br>';
					break;
				case 1:		// Господские
				case 10:	// Господские переходящие
					$gm = $refs[0]?$refs[0]:$ordinary_refs[0];
					$text = $event['name'].': '.($gm?(' Утр. - '.$gm):'').' Лит. - '.' '.$refs[1].' '.$refs[2].'<br>';
					break;
				default:
					
				}
			}
			// Перенос бденных и полиелейных праздников со дня Пасхи на понедельник
			if (($event["type"] == 2 || $event["type"] == 3) &&
				$this->bg_get_easter($year, 1) == $date && $this->bg_is_event_date ($event, $date, 1)) {	
					$refs = $event['refs'];
					$text .= 'и за воскресенье '.$event['name'].': Утр. - '.$refs[0].' Лит. -'.' '.$refs[1].'; '.$refs[2].'<br>';
			}
		}
		
		endif; 
		
		// Дополнительные чтения
		foreach ($additional as $event) {
			if ($this->bg_is_event_date ($event, $date) ) {
				$refs = $event['refs'];
				$text .= $event['name'].': '.($refs[0]?(' Утр. - '.$refs[0]):'').' '.$refs[1].' '.$refs[2].'<br>';
				
			}
		}
		return $text;
	}
}